{
  "nodes": [
    {
      "op": "null", 
      "name": "input_1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_layout_transform_20", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "func_name": "fused_layout_transform_20", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu_4", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ], 
        [
          5, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_max_pool2d_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "func_name": "fused_nn_max_pool2d_4", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          6, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu_3", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ], 
        [
          9, 
          0, 
          0
        ], 
        [
          10, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_max_pool2d_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "func_name": "fused_nn_max_pool2d_3", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          12, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_7", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          13, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ], 
        [
          15, 
          0, 
          0
        ], 
        [
          16, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_6", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          17, 
          0, 
          0
        ], 
        [
          18, 
          0, 
          0
        ], 
        [
          19, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu_2", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          21, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ], 
        [
          24, 
          0, 
          0
        ], 
        [
          25, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_max_pool2d_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "func_name": "fused_nn_max_pool2d_2", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          26, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_5", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          27, 
          0, 
          0
        ], 
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ], 
        [
          30, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_4", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          31, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ], 
        [
          33, 
          0, 
          0
        ], 
        [
          34, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu_1", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ], 
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ], 
        [
          39, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_max_pool2d_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "func_name": "fused_nn_max_pool2d_1", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          40, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_31", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_3", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ], 
        [
          43, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_21", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_2", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          45, 
          0, 
          0
        ], 
        [
          46, 
          0, 
          0
        ], 
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_3", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ], 
        [
          51, 
          0, 
          0
        ], 
        [
          52, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_2", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          53, 
          0, 
          0
        ], 
        [
          54, 
          0, 
          0
        ], 
        [
          55, 
          0, 
          0
        ], 
        [
          56, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p42", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p43", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          57, 
          0, 
          0
        ], 
        [
          58, 
          0, 
          0
        ], 
        [
          59, 
          0, 
          0
        ], 
        [
          60, 
          0, 
          0
        ], 
        [
          61, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_max_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "func_name": "fused_nn_max_pool2d", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          62, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p44", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p45", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p46", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          63, 
          0, 
          0
        ], 
        [
          64, 
          0, 
          0
        ], 
        [
          65, 
          0, 
          0
        ], 
        [
          66, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p47", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p48", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p49", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_1", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          67, 
          0, 
          0
        ], 
        [
          68, 
          0, 
          0
        ], 
        [
          69, 
          0, 
          0
        ], 
        [
          70, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p50", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p51", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p52", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          71, 
          0, 
          0
        ], 
        [
          72, 
          0, 
          0
        ], 
        [
          73, 
          0, 
          0
        ], 
        [
          74, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p53", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p54", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p55", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_1", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          75, 
          0, 
          0
        ], 
        [
          76, 
          0, 
          0
        ], 
        [
          77, 
          0, 
          0
        ], 
        [
          78, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p56", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p57", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p58", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          79, 
          0, 
          0
        ], 
        [
          80, 
          0, 
          0
        ], 
        [
          81, 
          0, 
          0
        ], 
        [
          82, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_layout_transform_19", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "func_name": "fused_layout_transform_19", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          83, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p59", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p60", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p61", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p62", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_sigmoid", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_sigmoid", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          84, 
          0, 
          0
        ], 
        [
          85, 
          0, 
          0
        ], 
        [
          86, 
          0, 
          0
        ], 
        [
          87, 
          0, 
          0
        ], 
        [
          88, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_layout_transform_18", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "func_name": "fused_layout_transform_18", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          89, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    4, 
    5, 
    8, 
    9, 
    10, 
    11, 
    14, 
    15, 
    16, 
    18, 
    19, 
    20, 
    22, 
    23, 
    24, 
    25, 
    28, 
    29, 
    30, 
    32, 
    33, 
    34, 
    36, 
    37, 
    38, 
    39, 
    42, 
    43, 
    44, 
    46, 
    47, 
    48, 
    50, 
    51, 
    52, 
    54, 
    55, 
    56, 
    58, 
    59, 
    60, 
    61, 
    64, 
    65, 
    66, 
    68, 
    69, 
    70, 
    72, 
    73, 
    74, 
    76, 
    77, 
    78, 
    80, 
    81, 
    82, 
    85, 
    86, 
    87, 
    88
  ], 
  "heads": [
    [
      90, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 3, 224, 224], 
        [1, 1, 224, 224, 3], 
        [4, 1, 3, 3, 3, 8], 
        [1, 4, 1, 1, 8], 
        [1, 4, 1, 1, 8], 
        [1, 4, 1, 1, 8], 
        [1, 4, 224, 224, 8], 
        [1, 4, 112, 112, 8], 
        [8, 4, 3, 3, 8, 8], 
        [1, 8, 1, 1, 8], 
        [1, 8, 1, 1, 8], 
        [1, 8, 1, 1, 8], 
        [1, 8, 112, 112, 8], 
        [1, 8, 56, 56, 8], 
        [16, 8, 3, 3, 8, 8], 
        [1, 16, 1, 1, 8], 
        [1, 16, 1, 1, 8], 
        [1, 16, 56, 56, 8], 
        [8, 16, 1, 1, 8, 8], 
        [1, 8, 1, 1, 8], 
        [1, 8, 1, 1, 8], 
        [1, 8, 56, 56, 8], 
        [16, 8, 3, 3, 8, 8], 
        [1, 16, 1, 1, 8], 
        [1, 16, 1, 1, 8], 
        [1, 16, 1, 1, 8], 
        [1, 16, 56, 56, 8], 
        [1, 16, 28, 28, 8], 
        [32, 16, 3, 3, 8, 8], 
        [1, 32, 1, 1, 8], 
        [1, 32, 1, 1, 8], 
        [1, 32, 28, 28, 8], 
        [16, 32, 1, 1, 8, 8], 
        [1, 16, 1, 1, 8], 
        [1, 16, 1, 1, 8], 
        [1, 16, 28, 28, 8], 
        [32, 16, 3, 3, 8, 8], 
        [1, 32, 1, 1, 8], 
        [1, 32, 1, 1, 8], 
        [1, 32, 1, 1, 8], 
        [1, 32, 28, 28, 8], 
        [1, 32, 14, 14, 8], 
        [64, 32, 3, 3, 8, 8], 
        [1, 64, 1, 1, 8], 
        [1, 64, 1, 1, 8], 
        [1, 64, 14, 14, 8], 
        [32, 64, 1, 1, 8, 8], 
        [1, 32, 1, 1, 8], 
        [1, 32, 1, 1, 8], 
        [1, 32, 14, 14, 8], 
        [64, 32, 3, 3, 8, 8], 
        [1, 64, 1, 1, 8], 
        [1, 64, 1, 1, 8], 
        [1, 64, 14, 14, 8], 
        [32, 64, 1, 1, 8, 8], 
        [1, 32, 1, 1, 8], 
        [1, 32, 1, 1, 8], 
        [1, 32, 14, 14, 8], 
        [64, 32, 3, 3, 8, 8], 
        [1, 64, 1, 1, 8], 
        [1, 64, 1, 1, 8], 
        [1, 64, 1, 1, 8], 
        [1, 64, 14, 14, 8], 
        [1, 64, 7, 7, 8], 
        [128, 64, 3, 3, 8, 8], 
        [1, 128, 1, 1, 8], 
        [1, 128, 1, 1, 8], 
        [1, 128, 7, 7, 8], 
        [64, 128, 1, 1, 8, 8], 
        [1, 64, 1, 1, 8], 
        [1, 64, 1, 1, 8], 
        [1, 64, 7, 7, 8], 
        [128, 64, 3, 3, 8, 8], 
        [1, 128, 1, 1, 8], 
        [1, 128, 1, 1, 8], 
        [1, 128, 7, 7, 8], 
        [64, 128, 1, 1, 8, 8], 
        [1, 64, 1, 1, 8], 
        [1, 64, 1, 1, 8], 
        [1, 64, 7, 7, 8], 
        [128, 64, 3, 3, 8, 8], 
        [1, 128, 1, 1, 8], 
        [1, 128, 1, 1, 8], 
        [1, 128, 7, 7, 8], 
        [1, 256, 7, 7, 4], 
        [1, 256, 1, 1, 4, 5], 
        [1, 1, 1, 1, 5], 
        [1, 1, 1, 1, 5], 
        [1, 1, 1, 1, 5], 
        [1, 1, 7, 7, 5], 
        [1, 5, 7, 7]
      ]
    ], 
    "storage_id": [
      "list_int", 
      [
        0, 
        1, 
        2, 
        3, 
        4, 
        5, 
        6, 
        1, 
        7, 
        8, 
        9, 
        10, 
        6, 
        1, 
        11, 
        12, 
        13, 
        6, 
        14, 
        15, 
        16, 
        1, 
        17, 
        18, 
        19, 
        20, 
        6, 
        1, 
        21, 
        22, 
        23, 
        6, 
        24, 
        25, 
        26, 
        1, 
        27, 
        28, 
        29, 
        30, 
        6, 
        1, 
        31, 
        32, 
        33, 
        6, 
        34, 
        35, 
        36, 
        1, 
        37, 
        38, 
        39, 
        6, 
        40, 
        41, 
        42, 
        1, 
        43, 
        44, 
        45, 
        46, 
        6, 
        1, 
        47, 
        48, 
        49, 
        50, 
        51, 
        52, 
        53, 
        1, 
        54, 
        55, 
        56, 
        50, 
        57, 
        58, 
        59, 
        1, 
        60, 
        61, 
        62, 
        50, 
        1, 
        63, 
        64, 
        65, 
        66, 
        67, 
        68
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91
  ]
}